Terraform Plan:
```aws_cloudwatch_log_group.ecs_log_group: Refreshing state... [id=/ecs/siem]
aws_vpc.main: Refreshing state... [id=vpc-03e05ec4d7ef91467]
aws_eip.nat_eip: Refreshing state... [id=eipalloc-013904bf197fc22ee]
aws_iam_role.ecs_execution_role: Refreshing state... [id=ecs_execution_role]
aws_security_group.fargate_sg: Refreshing state... [id=sg-0788f6d6e7e5e4270]
aws_iam_role_policy.ecs_execution_role_policy: Refreshing state... [id=ecs_execution_role:ecs_execution_role_policy]
aws_subnet.public2: Refreshing state... [id=subnet-0aaf48c52ec90dd1a]
aws_subnet.private1: Refreshing state... [id=subnet-0a892d70c825f21bc]
aws_subnet.private2: Refreshing state... [id=subnet-0c554a1b8323b1de4]
aws_subnet.public1: Refreshing state... [id=subnet-03d02c1913e5a7e17]
aws_security_group.all: Refreshing state... [id=sg-022d663f4177b31cd]
aws_internet_gateway.gw: Refreshing state... [id=igw-04d2dae30427425bb]
aws_lb_target_group.grafana_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/bd60c890dfb7d92f]
aws_route_table.public: Refreshing state... [id=rtb-07d5e5349f9e26179]
aws_nat_gateway.nat: Refreshing state... [id=nat-049492f46c4537f52]
aws_lb.grafana_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:loadbalancer/app/grafana-alb/9da52d4f8839500b]
aws_route_table_association.public2: Refreshing state... [id=rtbassoc-090db73de77cde073]
aws_route_table_association.public1: Refreshing state... [id=rtbassoc-029d604ae22b397e3]
aws_route_table.private: Refreshing state... [id=rtb-0ac24f37859269d8f]
aws_route_table_association.private1: Refreshing state... [id=rtbassoc-01b8de58aaedb4470]
aws_route_table_association.private2: Refreshing state... [id=rtbassoc-02605b946f56d70ea]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_lb_listener.grafana_listener will be created
  + resource "aws_lb_listener" "grafana_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:941133421128:loadbalancer/app/grafana-alb/9da52d4f8839500b"
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/bd60c890dfb7d92f"
          + type             = "forward"
        }
    }

  # aws_security_group.fargate_sg will be destroyed
  # (because aws_security_group.fargate_sg is not in configuration)
  - resource "aws_security_group" "fargate_sg" {
      - arn                    = "arn:aws:ec2:us-east-1:941133421128:security-group/sg-0788f6d6e7e5e4270" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0788f6d6e7e5e4270" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "terraform-20240123122754861900000001" -> null
      - name_prefix            = "terraform-" -> null
      - owner_id               = "941133421128" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-03e05ec4d7ef91467" -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```